In [13]:
import pandas as pd
from sqlalchemy import create_engine

# Extract CSV files into DataFrames

In [14]:
# Load baseball csv into a dataframe
baseball_file = "Resources/mlbsalaries.csv"
baseball_df = pd.read_csv(baseball_file)
baseball_df.head()

        salary               name  total_value pos     years   avg_annual team
0  $ 3,800,000  Darryl Strawberry  $ 3,800,000  OF  1 (1991)  $ 3,800,000  LAD
1  $ 3,750,000     Kevin Mitchell  $ 3,750,000  OF  1 (1991)  $ 3,750,000   SF
2  $ 3,750,000         Will Clark  $ 3,750,000  1B  1 (1991)  $ 3,750,000   SF
3  $ 3,625,000         Mark Davis  $ 3,625,000   P  1 (1991)  $ 3,625,000   KC
4  $ 3,600,000         Eric Davis  $ 3,600,000  OF  1 (1991)  $ 3,600,000  CIN

In [15]:
# Load basketball csv into a dataframe
basketball_file = "Resources/nbasalaries.csv"
basketball_df = pd.read_csv(basketball_file)
basketball_df.head()

   RK          NAME TEAM  SALARY           Team Rank
0   1  LeBron James  CLE       30963450.0          1
1   2    Al Horford  BOS       26540100.0          1
2   3  Kevin Durant  GSW       26540100.0          1
3   4  James Harden  HOU       26540100.0          1
4   5   Mike Conley  MEM       26540100.0          1

In [16]:
# Load football csv into a dataframe
football_file = "Resources/nflsalaries.csv"
football_df = pd.read_csv(football_file)
football_df.head()

             name  pos   cap_hit  cap_percent  season               team
0  Russell Wilson   QB  31000000        15.53    2020   seattle-seahawks
1   Aaron Rodgers   QB  29672000        15.06    2019  green-bay-packers
2    Kirk Cousins   QB  29000000        15.12    2019  minnesota-vikings
3      Jared Goff   QB  28842682        14.15    2020   los-angeles-rams
4     Khalil Mack  OLB  26600000        12.52    2020      chicago-bears

# Transform Baseball DataFrame